zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/component/afec.h
/* -------- AFEC_CWR : (AFEC Offset: 0x50) (R/W 32) AFEC Compare Window Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t LOWTHRES:16;               /**< bit:  0..15  Low Threshold                            */
    uint32_t HIGHTHRES:16;              /**< bit: 16..31  High Threshold                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_CWR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_CWR_OFFSET                     (0x50)                                        /**<  (AFEC_CWR) AFEC Compare Window Register  Offset */

#define AFEC_CWR_LOWTHRES_Pos               0                                              /**< (AFEC_CWR) Low Threshold Position */
#define AFEC_CWR_LOWTHRES_Msk               (_U_(0xFFFF) << AFEC_CWR_LOWTHRES_Pos)         /**< (AFEC_CWR) Low Threshold Mask */
#define AFEC_CWR_LOWTHRES(value)            (AFEC_CWR_LOWTHRES_Msk & ((value) << AFEC_CWR_LOWTHRES_Pos))
#define AFEC_CWR_HIGHTHRES_Pos              16                                             /**< (AFEC_CWR) High Threshold Position */
#define AFEC_CWR_HIGHTHRES_Msk              (_U_(0xFFFF) << AFEC_CWR_HIGHTHRES_Pos)        /**< (AFEC_CWR) High Threshold Mask */
#define AFEC_CWR_HIGHTHRES(value)           (AFEC_CWR_HIGHTHRES_Msk & ((value) << AFEC_CWR_HIGHTHRES_Pos))
#define AFEC_CWR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (AFEC_CWR) Register MASK  (Use AFEC_CWR_Msk instead)  */
#define AFEC_CWR_Msk                        _U_(0xFFFFFFFF)                                /**< (AFEC_CWR) Register Mask  */


/* -------- AFEC_CGR : (AFEC Offset: 0x54) (R/W 32) AFEC Channel Gain Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t GAIN0:2;                   /**< bit:   0..1  Gain for Channel 0                       */
    uint32_t GAIN1:2;                   /**< bit:   2..3  Gain for Channel 1                       */
    uint32_t GAIN2:2;                   /**< bit:   4..5  Gain for Channel 2                       */
    uint32_t GAIN3:2;                   /**< bit:   6..7  Gain for Channel 3                       */
    uint32_t GAIN4:2;                   /**< bit:   8..9  Gain for Channel 4                       */
    uint32_t GAIN5:2;                   /**< bit: 10..11  Gain for Channel 5                       */
    uint32_t GAIN6:2;                   /**< bit: 12..13  Gain for Channel 6                       */
    uint32_t GAIN7:2;                   /**< bit: 14..15  Gain for Channel 7                       */
    uint32_t GAIN8:2;                   /**< bit: 16..17  Gain for Channel 8                       */
    uint32_t GAIN9:2;                   /**< bit: 18..19  Gain for Channel 9                       */
    uint32_t GAIN10:2;                  /**< bit: 20..21  Gain for Channel 10                      */
    uint32_t GAIN11:2;                  /**< bit: 22..23  Gain for Channel 11                      */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_CGR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_CGR_OFFSET                     (0x54)                                        /**<  (AFEC_CGR) AFEC Channel Gain Register  Offset */

#define AFEC_CGR_GAIN0_Pos                  0                                              /**< (AFEC_CGR) Gain for Channel 0 Position */
#define AFEC_CGR_GAIN0_Msk                  (_U_(0x3) << AFEC_CGR_GAIN0_Pos)               /**< (AFEC_CGR) Gain for Channel 0 Mask */
#define AFEC_CGR_GAIN0(value)               (AFEC_CGR_GAIN0_Msk & ((value) << AFEC_CGR_GAIN0_Pos))
#define AFEC_CGR_GAIN1_Pos                  2                                              /**< (AFEC_CGR) Gain for Channel 1 Position */
#define AFEC_CGR_GAIN1_Msk                  (_U_(0x3) << AFEC_CGR_GAIN1_Pos)               /**< (AFEC_CGR) Gain for Channel 1 Mask */
#define AFEC_CGR_GAIN1(value)               (AFEC_CGR_GAIN1_Msk & ((value) << AFEC_CGR_GAIN1_Pos))
#define AFEC_CGR_GAIN2_Pos                  4                                              /**< (AFEC_CGR) Gain for Channel 2 Position */
#define AFEC_CGR_GAIN2_Msk                  (_U_(0x3) << AFEC_CGR_GAIN2_Pos)               /**< (AFEC_CGR) Gain for Channel 2 Mask */
#define AFEC_CGR_GAIN2(value)               (AFEC_CGR_GAIN2_Msk & ((value) << AFEC_CGR_GAIN2_Pos))
#define AFEC_CGR_GAIN3_Pos                  6                                              /**< (AFEC_CGR) Gain for Channel 3 Position */
#define AFEC_CGR_GAIN3_Msk                  (_U_(0x3) << AFEC_CGR_GAIN3_Pos)               /**< (AFEC_CGR) Gain for Channel 3 Mask */
#define AFEC_CGR_GAIN3(value)               (AFEC_CGR_GAIN3_Msk & ((value) << AFEC_CGR_GAIN3_Pos))
#define AFEC_CGR_GAIN4_Pos                  8                                              /**< (AFEC_CGR) Gain for Channel 4 Position */
#define AFEC_CGR_GAIN4_Msk                  (_U_(0x3) << AFEC_CGR_GAIN4_Pos)               /**< (AFEC_CGR) Gain for Channel 4 Mask */
#define AFEC_CGR_GAIN4(value)               (AFEC_CGR_GAIN4_Msk & ((value) << AFEC_CGR_GAIN4_Pos))
#define AFEC_CGR_GAIN5_Pos                  10                                             /**< (AFEC_CGR) Gain for Channel 5 Position */
#define AFEC_CGR_GAIN5_Msk                  (_U_(0x3) << AFEC_CGR_GAIN5_Pos)               /**< (AFEC_CGR) Gain for Channel 5 Mask */
#define AFEC_CGR_GAIN5(value)               (AFEC_CGR_GAIN5_Msk & ((value) << AFEC_CGR_GAIN5_Pos))
#define AFEC_CGR_GAIN6_Pos                  12                                             /**< (AFEC_CGR) Gain for Channel 6 Position */
#define AFEC_CGR_GAIN6_Msk                  (_U_(0x3) << AFEC_CGR_GAIN6_Pos)               /**< (AFEC_CGR) Gain for Channel 6 Mask */
#define AFEC_CGR_GAIN6(value)               (AFEC_CGR_GAIN6_Msk & ((value) << AFEC_CGR_GAIN6_Pos))
#define AFEC_CGR_GAIN7_Pos                  14                                             /**< (AFEC_CGR) Gain for Channel 7 Position */
#define AFEC_CGR_GAIN7_Msk                  (_U_(0x3) << AFEC_CGR_GAIN7_Pos)               /**< (AFEC_CGR) Gain for Channel 7 Mask */
#define AFEC_CGR_GAIN7(value)               (AFEC_CGR_GAIN7_Msk & ((value) << AFEC_CGR_GAIN7_Pos))
#define AFEC_CGR_GAIN8_Pos                  16                                             /**< (AFEC_CGR) Gain for Channel 8 Position */
#define AFEC_CGR_GAIN8_Msk                  (_U_(0x3) << AFEC_CGR_GAIN8_Pos)               /**< (AFEC_CGR) Gain for Channel 8 Mask */
#define AFEC_CGR_GAIN8(value)               (AFEC_CGR_GAIN8_Msk & ((value) << AFEC_CGR_GAIN8_Pos))
#define AFEC_CGR_GAIN9_Pos                  18                                             /**< (AFEC_CGR) Gain for Channel 9 Position */
#define AFEC_CGR_GAIN9_Msk                  (_U_(0x3) << AFEC_CGR_GAIN9_Pos)               /**< (AFEC_CGR) Gain for Channel 9 Mask */
#define AFEC_CGR_GAIN9(value)               (AFEC_CGR_GAIN9_Msk & ((value) << AFEC_CGR_GAIN9_Pos))
#define AFEC_CGR_GAIN10_Pos                 20                                             /**< (AFEC_CGR) Gain for Channel 10 Position */
#define AFEC_CGR_GAIN10_Msk                 (_U_(0x3) << AFEC_CGR_GAIN10_Pos)              /**< (AFEC_CGR) Gain for Channel 10 Mask */
#define AFEC_CGR_GAIN10(value)              (AFEC_CGR_GAIN10_Msk & ((value) << AFEC_CGR_GAIN10_Pos))
#define AFEC_CGR_GAIN11_Pos                 22                                             /**< (AFEC_CGR) Gain for Channel 11 Position */
#define AFEC_CGR_GAIN11_Msk                 (_U_(0x3) << AFEC_CGR_GAIN11_Pos)              /**< (AFEC_CGR) Gain for Channel 11 Mask */
#define AFEC_CGR_GAIN11(value)              (AFEC_CGR_GAIN11_Msk & ((value) << AFEC_CGR_GAIN11_Pos))
#define AFEC_CGR_MASK                       _U_(0xFFFFFF)                                  /**< \deprecated (AFEC_CGR) Register MASK  (Use AFEC_CGR_Msk instead)  */
#define AFEC_CGR_Msk                        _U_(0xFFFFFF)                                  /**< (AFEC_CGR) Register Mask  */


/* -------- AFEC_DIFFR : (AFEC Offset: 0x60) (R/W 32) AFEC Channel Differential Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DIFF0:1;                   /**< bit:      0  Differential inputs for channel 0        */
    uint32_t DIFF1:1;                   /**< bit:      1  Differential inputs for channel 1        */
    uint32_t DIFF2:1;                   /**< bit:      2  Differential inputs for channel 2        */
    uint32_t DIFF3:1;                   /**< bit:      3  Differential inputs for channel 3        */
    uint32_t DIFF4:1;                   /**< bit:      4  Differential inputs for channel 4        */
    uint32_t DIFF5:1;                   /**< bit:      5  Differential inputs for channel 5        */
    uint32_t DIFF6:1;                   /**< bit:      6  Differential inputs for channel 6        */
    uint32_t DIFF7:1;                   /**< bit:      7  Differential inputs for channel 7        */
    uint32_t DIFF8:1;                   /**< bit:      8  Differential inputs for channel 8        */
    uint32_t DIFF9:1;                   /**< bit:      9  Differential inputs for channel 9        */
    uint32_t DIFF10:1;                  /**< bit:     10  Differential inputs for channel 10       */
    uint32_t DIFF11:1;                  /**< bit:     11  Differential inputs for channel 11       */
    uint32_t :20;                       /**< bit: 12..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t DIFF:12;                   /**< bit:  0..11  Differential inputs for channel xx       */
    uint32_t :20;                       /**< bit: 12..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_DIFFR_Type;
