zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/component/afec.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AFEC_DIFFR_OFFSET                   (0x60)                                        /**<  (AFEC_DIFFR) AFEC Channel Differential Register  Offset */

#define AFEC_DIFFR_DIFF0_Pos                0                                              /**< (AFEC_DIFFR) Differential inputs for channel 0 Position */
#define AFEC_DIFFR_DIFF0_Msk                (_U_(0x1) << AFEC_DIFFR_DIFF0_Pos)             /**< (AFEC_DIFFR) Differential inputs for channel 0 Mask */
#define AFEC_DIFFR_DIFF0                    AFEC_DIFFR_DIFF0_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_DIFFR_DIFF0_Msk instead */
#define AFEC_DIFFR_DIFF1_Pos                1                                              /**< (AFEC_DIFFR) Differential inputs for channel 1 Position */
#define AFEC_DIFFR_DIFF1_Msk                (_U_(0x1) << AFEC_DIFFR_DIFF1_Pos)             /**< (AFEC_DIFFR) Differential inputs for channel 1 Mask */
#define AFEC_DIFFR_DIFF1                    AFEC_DIFFR_DIFF1_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_DIFFR_DIFF1_Msk instead */
#define AFEC_DIFFR_DIFF2_Pos                2                                              /**< (AFEC_DIFFR) Differential inputs for channel 2 Position */
#define AFEC_DIFFR_DIFF2_Msk                (_U_(0x1) << AFEC_DIFFR_DIFF2_Pos)             /**< (AFEC_DIFFR) Differential inputs for channel 2 Mask */
#define AFEC_DIFFR_DIFF2                    AFEC_DIFFR_DIFF2_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_DIFFR_DIFF2_Msk instead */
#define AFEC_DIFFR_DIFF3_Pos                3                                              /**< (AFEC_DIFFR) Differential inputs for channel 3 Position */
#define AFEC_DIFFR_DIFF3_Msk                (_U_(0x1) << AFEC_DIFFR_DIFF3_Pos)             /**< (AFEC_DIFFR) Differential inputs for channel 3 Mask */
#define AFEC_DIFFR_DIFF3                    AFEC_DIFFR_DIFF3_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_DIFFR_DIFF3_Msk instead */
#define AFEC_DIFFR_DIFF4_Pos                4                                              /**< (AFEC_DIFFR) Differential inputs for channel 4 Position */
#define AFEC_DIFFR_DIFF4_Msk                (_U_(0x1) << AFEC_DIFFR_DIFF4_Pos)             /**< (AFEC_DIFFR) Differential inputs for channel 4 Mask */
#define AFEC_DIFFR_DIFF4                    AFEC_DIFFR_DIFF4_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_DIFFR_DIFF4_Msk instead */
#define AFEC_DIFFR_DIFF5_Pos                5                                              /**< (AFEC_DIFFR) Differential inputs for channel 5 Position */
#define AFEC_DIFFR_DIFF5_Msk                (_U_(0x1) << AFEC_DIFFR_DIFF5_Pos)             /**< (AFEC_DIFFR) Differential inputs for channel 5 Mask */
#define AFEC_DIFFR_DIFF5                    AFEC_DIFFR_DIFF5_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_DIFFR_DIFF5_Msk instead */
#define AFEC_DIFFR_DIFF6_Pos                6                                              /**< (AFEC_DIFFR) Differential inputs for channel 6 Position */
#define AFEC_DIFFR_DIFF6_Msk                (_U_(0x1) << AFEC_DIFFR_DIFF6_Pos)             /**< (AFEC_DIFFR) Differential inputs for channel 6 Mask */
#define AFEC_DIFFR_DIFF6                    AFEC_DIFFR_DIFF6_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_DIFFR_DIFF6_Msk instead */
#define AFEC_DIFFR_DIFF7_Pos                7                                              /**< (AFEC_DIFFR) Differential inputs for channel 7 Position */
#define AFEC_DIFFR_DIFF7_Msk                (_U_(0x1) << AFEC_DIFFR_DIFF7_Pos)             /**< (AFEC_DIFFR) Differential inputs for channel 7 Mask */
#define AFEC_DIFFR_DIFF7                    AFEC_DIFFR_DIFF7_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_DIFFR_DIFF7_Msk instead */
#define AFEC_DIFFR_DIFF8_Pos                8                                              /**< (AFEC_DIFFR) Differential inputs for channel 8 Position */
#define AFEC_DIFFR_DIFF8_Msk                (_U_(0x1) << AFEC_DIFFR_DIFF8_Pos)             /**< (AFEC_DIFFR) Differential inputs for channel 8 Mask */
#define AFEC_DIFFR_DIFF8                    AFEC_DIFFR_DIFF8_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_DIFFR_DIFF8_Msk instead */
#define AFEC_DIFFR_DIFF9_Pos                9                                              /**< (AFEC_DIFFR) Differential inputs for channel 9 Position */
#define AFEC_DIFFR_DIFF9_Msk                (_U_(0x1) << AFEC_DIFFR_DIFF9_Pos)             /**< (AFEC_DIFFR) Differential inputs for channel 9 Mask */
#define AFEC_DIFFR_DIFF9                    AFEC_DIFFR_DIFF9_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_DIFFR_DIFF9_Msk instead */
#define AFEC_DIFFR_DIFF10_Pos               10                                             /**< (AFEC_DIFFR) Differential inputs for channel 10 Position */
#define AFEC_DIFFR_DIFF10_Msk               (_U_(0x1) << AFEC_DIFFR_DIFF10_Pos)            /**< (AFEC_DIFFR) Differential inputs for channel 10 Mask */
#define AFEC_DIFFR_DIFF10                   AFEC_DIFFR_DIFF10_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_DIFFR_DIFF10_Msk instead */
#define AFEC_DIFFR_DIFF11_Pos               11                                             /**< (AFEC_DIFFR) Differential inputs for channel 11 Position */
#define AFEC_DIFFR_DIFF11_Msk               (_U_(0x1) << AFEC_DIFFR_DIFF11_Pos)            /**< (AFEC_DIFFR) Differential inputs for channel 11 Mask */
#define AFEC_DIFFR_DIFF11                   AFEC_DIFFR_DIFF11_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use AFEC_DIFFR_DIFF11_Msk instead */
#define AFEC_DIFFR_MASK                     _U_(0xFFF)                                     /**< \deprecated (AFEC_DIFFR) Register MASK  (Use AFEC_DIFFR_Msk instead)  */
#define AFEC_DIFFR_Msk                      _U_(0xFFF)                                     /**< (AFEC_DIFFR) Register Mask  */

#define AFEC_DIFFR_DIFF_Pos                 0                                              /**< (AFEC_DIFFR Position) Differential inputs for channel xx */
#define AFEC_DIFFR_DIFF_Msk                 (_U_(0xFFF) << AFEC_DIFFR_DIFF_Pos)            /**< (AFEC_DIFFR Mask) DIFF */
#define AFEC_DIFFR_DIFF(value)              (AFEC_DIFFR_DIFF_Msk & ((value) << AFEC_DIFFR_DIFF_Pos))  

/* -------- AFEC_CSELR : (AFEC Offset: 0x64) (R/W 32) AFEC Channel Selection Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CSEL:4;                    /**< bit:   0..3  Channel Selection                        */
    uint32_t :28;                       /**< bit:  4..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} AFEC_CSELR_Type;
